module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'CHAND TRICKER',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 P𝐌 ⏳            جو خدا کو یاد کرتا ہے، خدا بھی اس کو یاد کرتا ہے          Whoever remembers Allah, Allah remembers them too.               \nMIAN AMIR\N──── •💜• ────']
},
{
timer: '1:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 P𝐌 ⏳            تو جو کچھ بھی کرے رب کی رضا کے لئے کر 🥀     Whatever you do, do it for the sake of Allahs pleasure.          \nMIAN AMIR\N──── •💜• ────']
},
{
timer: '2:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 A𝐌 ⏳              جب اللہ تم سے محبت کرتا ہے، وہ تم کو پرکشش بناتا ہے۔                 When Allah loves you, He makes you attractive.                   \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '3:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 A𝐌 ⏳             توبہ کیسی بھی ہو، ہر کوئی معافی چاہتا ہے۔                           No matter how big your sin, everyone desires forgiveness    \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '4:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 A𝐌 ⏳              بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ        تمام تعریف خدا ہی کی ہے جو تمام جہانوں کا مالک ہے۔                                   \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '5:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 A𝐌 ⏳             جنات میں سب سے زیادہ برکت والی چیزیں، نماز اور دعا ہیں                The most blessed things in Paradise are prayer and supplication                     \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '6:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝗔𝐌 ⏳            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ        تمام تعریف خدا ہی کی ہے جو تمام جہانوں کا مالک ہے۔                                   \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '7:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 A𝐌 ⏳             توبہ اس لئے کرو کہ تم اپنی زندگی بدلوانا چاہتے ہو                    Repent because you want to change your life.                         \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '8:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 A𝐌 ⏳            توبہ آسان ہو سکتی ہے، لیکن نیت صاف رکھنا مشکل ہے۔🥰            Repentance can be easy, but keeping intentions pure is difficult.                        \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '9:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00 A𝐌 ⏳            توبہ آسان ہو سکتی ہے، لیکن نیت صاف رکھنا مشکل ہے۔🥰            Repentance can be easy, but keeping intentions pure is difficult.                       ཫ \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '10:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 A𝐌 ⏳           سب سے بڑی کامیابی، خدا کی خوشنودی ہے         The greatest success is Allahs pleasure.                                                    \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '11:00:00 AM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 A𝐌 ⏳            اقرأ باسم ربک الذی خلق                     "پڑھو، اپنے رب کے نام سے جس نے تمہیں پیدا کیا"                                                         \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '12:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:00 A𝐌 ⏳            يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَاءٌ لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ                                          اے لوگو! تمہارے پاس تمہارے پروردگار کی طرف سے نصیحت آئی ہے اور دلوں کے لئے شفا بھی  اور مومنوں کے لئے ہدایت اور رحمت بھی                                  \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '1:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:00 A𝐌 ⏳             قَالُوا۟ رَبَّنَآ إِنَّا نَخَافُ أَن يَفۡرُطَ عَلَيۡنَآ أَوۡ أَن يَطۡغَىٰ                                    وہ کہتے ہیں: اے ہمارے رب! ہمیں خوف ہے کہ یہ شخص ہم پر زیادتی کرے یا غلطی کرے۔                                   \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '2:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:00 𝐏𝐌 ⏳            بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الرَّحْمَٰنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنسَانَ عَلَّمَهُ الْبَيَانَ الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ أَلَّا تَطْغَوْا فِي الْمِيزَانِ وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ                                                            اللہ کے نام سے جو بہت مہربان رحمت والا ہے۔ (یعنی) اس (رحمت والے) نے قرآن کو سکھایا۔ اور انسان کو بنایا۔ اور اسے بیان کرنا سکھایا۔ سورج اور چاند کو بہ کھاتے پیمانے مقرر کر دیا۔ اور ستارے اور درخت سجدہ کرتے ہیں اور اس نے آسمان کو بلند کیا اور ترازو رکھا۔ تاکہ تم وزن میں لمبا نہ پڑو اور ترازو کو نقصان نہ پہنچاؤ۔                                                                   \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '3:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:00 𝐏𝐌 ⏳           بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الرَّحْمَٰنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنسَانَ عَلَّمَهُ الْبَيَانَ الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ أَلَّا تَطْغَوْا فِي الْمِيزَانِ وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ                                                            اللہ کے نام سے جو بہت مہربان رحمت والا ہے۔ (یعنی) اس (رحمت والے) نے قرآن کو سکھایا۔ اور انسان کو بنایا۔ اور اسے بیان کرنا سکھایا۔ سورج اور چاند کو بہ کھاتے پیمانے مقرر کر دیا۔ اور ستارے اور درخت سجدہ کرتے ہیں اور اس نے آسمان کو بلند کیا اور ترازو رکھا۔ تاکہ تم وزن میں لمبا نہ پڑو اور ترازو کو نقصان نہ پہنچاؤ۔                                                                  \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '4:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:00 𝐏𝐌 ⏳                 يَا أَيُّهَا الْمُزَّمِّلُ قُمِ اللَّيْلَ إِلَّا قَلِيلًا نِّصْفَهُ أَوِ انقُصْ مِنْهُ قَلِيلًا أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا.                                            اے لبادہ باندھنے والے بندے! رات کو جلدی جگو، (پوری رات نہیں) سوئے سے آدھی رات میں سے تھوڑا سا کم کرو یا زیادہ کرو اور قرآن کو قافلوں وار حکمت سے پڑھو                                                 O you wrapped in garments! Stand (to pray) all night, except for a little, half of it or subtract from it a little, or add to it, and recite the Quran with measured recitation.                                                \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '5:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:00 𝐏𝐌 ⏳            اللہ کے ہمیشہ بہترین پلانز ہوتے ہیں                                  Allah always has the best plans.                                    \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '6:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:00 𝐏𝐌 ⏳                 دنیا جو تمہیں نہیں ملتی، خدا تمہیں دے سکتا ہے" - حضرت محمد ﷺ            What the world cannot give you, Allah can give you." - Prophet Muhammad ﷺ                                                     \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '7:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:00 𝐏𝐌 ⏳             آدمی اس چیز کا حاکم ہوگا جس کی اسے آرزو ہوگی" - حضرت علی (رضی اللہ عنہ)            Man will have what he desires." - Hazrat Ali (RA)                                 \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '8:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:00 𝐏𝐌 ⏳             Taqwa insaan ko asal kamyaabi aur sakoon deta hai               \nMIAN AMIR\N──── •💜• ────']
},
{
timer: '9:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:00 𝐏𝐌 ⏳              Dunya mehsoos hone wala sukoon, sirf Allah ke hukam ko maanney se milta hai                                              \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '10:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:00 𝐏𝐌 ⏳Mehnat aur dua ka muntazir rahain, jab tak kamyabi nahi milti.              \nMIAN AMIR\n──── •💜• ────']
},
{
timer: '11:00:00 PM',
message: ['──── •💜• ────\n                𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:00 P𝐌 ⏳              اے ایمان والو! صبر اور نماز کے ذریعے آپس میں تعاون کرو               O you who believe! Cooperate with one another through patience and prayer           \nMIAN AMIR\n──── •💜• ────']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};